# Напишіть скрипт, який виводить на екран прямокутник із '*'.
# Висота і ширина прямокутника вводяться з клавіатури.
# Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.
# *****
# *   *
# *   *
# *****

STAR="*"
w, h = (int(input("введіть ширину=")), int(input("введіть висоту=")))
for i in range(h):
    if i == 0 or i == h-1:
        for j in range(w):
            print(STAR, end=" ")
    else:
        print(STAR, end=" ")
        for j in range(1, w-1):
            print()
        print(STAR, end=" ")
    print()